import React, { Component } from 'react'
import './Policy.css'

class Policy extends Component {

    componentDidMount() {
        window.scrollTo(0, 0)
    }

    render() {
        return (
            <div className="policy-page">
                <h2 className="policy-header">תקנון ומדיניות Bucard</h2>
                <hr />
                <div className="policy-content-div">
                    <h2 className="policy-content-header">מבוא</h2>
                    <div className="policy-content">
                        <ul>
                            <li>זה מותג ליצירת כרטיסי ביקור דיגיטלים השירות בתשלום מתחדש bucard</li>
                            <li>תנאי שימוש אלו חלים ויחולו על כל שימוש באתר.</li>
                            <li>באמצעות שימוש בשירות, אתה מקבל את התנאים הללו. אם אינך מסכים לתנאים אלה, אל תשתמש בשירות.</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">תנאי שימוש</h2>
                    <div className="policy-content">
                        <ul>
                            <li>למשתמש רשות להשתמש בשירותי האתר בכפוף לאמור בהסכם זה.</li>
                            <li>המשתמש מצהיר כי הוא מעל גיל 18 ובעל כשרות משפטית להתקשר עם בעלי האתר בהסכם זה.</li>
                            <li>על הלקוח חלה האחריות הבלעדית על כל תוכן שיתפרסם בכרטיס ביקור הדיגיטלי שלו.</li>
                            <li>בכל מקרה בעלי האתר והמותג לא יהיו אחראית לכל נזק עקיף או תוצאתי מכל סוג שהוא (לרבות אך מבלי לגרוע, נזקים תוצאתיים, מיוחדים או מקריים, אובדן רווחים עסקיים, הפרעה לעסקי הלקוח, אובדן מידע עסקי או כל נזק כספי אחר) כתוצאה משימוש או חוסר יכולת להשתמש בתוכנת האתר, וזאת אף אם קיבלה התראה מפני אפשרות לנזקים אלה. בכל מקרה, המותג לא תהייה אחראית באחריות החורגת מהסכום ששולם על-ידי הלקוח בהתאם להסכם זה.</li>
                            <li>המשתמש מאשר הרשמה לרשימת תפוצה וקבלת מידע פרסומי מהספק, למען הסר ספק, ניתן בכל עת לצאת מן השירות.</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">הרשמה</h2>
                    <div className="policy-content">
                        <ul>
                            <li>במסגרת ההרשמה תידרש למסור מידע אישי: שם, כתובת, דרכי ההתקשרות, דואר האלקטרוני ו/או פרטי כרטיס האשראי שברשותך. הנתונים שתמסור בעת ההרשמה יישמרו במאגר המידע של המערכת. אינך חייב על-פי חוק למסור את המידע אולם בלעדיו לא תוכל להשתמש בשירותים הניתנים. הנך מתבקש לנהוג בקפידה במסירת הפרטים ולמסור פרטים נכונים בלבד. בעת הרישום תקבל מהמערכת סיסמה. הסיסמה תשמש אותך בכל שימוש בשירותי המערכת ולצורך הזדהות. שמור על הסיסמה בסודיות כדי למנוע מאחרים שימוש לרעה בהם. הקפד להחליף את הסיסמה בתדירות גבוהה ככל האפשר, ובכל מקרה אחת לשלושה חודשים לפחות.</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">גיבויים</h2>
                    <div className="policy-content">
                        <ul>
                            <li>
                                הספק לא יהיה אחראי על גיבוי התוכן בכרטיס ביקור הדיגיטלי של הלקוח ובאחריות הלקוח ליצור עותק מכל דבר שהוא מעלה למערכת. הספק יעשה את המקסימום לשמור על המידע והחומר המצוי בכרטיס ביקור הדיגיטלי של הלקוח כולל גיבויו אך אין הוא יכול להיות אחראי עליו
                            </li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">סימני מסחר</h2>
                    <div className="policy-content">
                        <ul>
                            <li>
                                סימני המסחר המופיעים בכרטיס ביקור הדיגיטלי הנם בחזקת בעליהם, לפי העניין.
                            </li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">שימוש לרעה</h2>
                    <div className="policy-content">
                        <ul>
                            <li>הספק רשאי לסגור כרטיס ביקור דיגיטלי באם עבר על אחד הכללים הנמצאים בתוכן "תנאי השימוש" כולו, ולשם הבהרה הובאו ורוכזו בסעיפים הבאים:</li>
                            <li>תוכן למבוגרים בלבד.</li>
                            <li>תוכן מוגן בזכויות יוצרים: מוסיקה, סרטים או משחקים שאינך מחזיקים בזכויות</li>
                            <li>ספאם / קידום אתרים: כרטיס ביקור דיגיטלי שמטרתו היחידה הוא להשיג את דירוג גוגל, פייסבוק , וכו' .</li>
                            <li>פישינג (התחזות): לגרום למשתמשים לספק את שם המשתמש והסיסמה שלהם.</li>
                            <li>הונאות: להתעשר מהר, פירמידה / שיווק רשתי, או תוכניות מפוקפקות אחרות.</li>
                            <li>רשימה זו היא התייחסות מהירה, והוא לא אמור להיות מלאה. לקבלת מידע ספציפי יותר, עיין בתנאים שלהלן.</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">גרפיקה</h2>
                    <div className="policy-content">
                        <ul>
                            <li>דמי השירות אינם כוללים שירותים גרפיים ו/או עיצוב מצד הספק.</li>
                            <li>תשלום עבור עיצוב הכרטיס ביקור דיגיטלי ע"י הספק יבוצע בנפרד.</li>
                            <li>למען הסר ספק, ניתן באמצעות המערכת לעצב את הכרטיס ביקור ללא עזרת הספק.</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">תשלומים</h2>
                    <div className="policy-content">
                        <ul>
                            <li>הלקוח מתחייב לספק תשלום מתאים עבור השירותים שיתקבלו מהספק, מראש ולפני קבלתם. הלקוח מסכים כי עד אשר יודיע לספק, אם בכלל, כי ברצונו לבטל חלק מן השירותים או את כולם, הוא יחוייב בתשלום עבורם על בסיס קבוע</li>
                            <li>ביטולים יכולים להתבצע בכל זמן נתון באמצעות כניסה לאזור הלקוחות באתר וביטול השירות המבוקש. אם הגשת בקשת הביטול, חשבונך יימחק מהמערכת בתוך 24 ש'. באם לא נתקבל מאתנו מענה או דוא"ל המאשר את הביטול, אנא צור עמנו קשר באופן מידיי.</li>
                            <li>על אחריותך לוודא כי אמצעי התשלום שלך מעודכנים, וכי כל החשבוניות משולמות במועדן.</li>
                            <li>למרות שלספק הזכות לבצע שינויים במחירים עבור כל שירותי הספק בכל עת, הרי שהמחירים מובטחים לתקופה ששולמה מראש</li>
                            <li>מקרה בו מספר כרטיס האשראי או תוקפו יגררו דחיית ביצוע סליקה על ידי חברות האשראי, הספק עשוי להשעות באופן מידיי את השירותים אותם הוא מספק ללקוח, עד לבירור נושא התשלום במלואו ולחיוב מלא בפועל</li>
                            <li>הלקוח מחויב לביצוע תשלום שוטף ומלא בכל התקופה בה חשבונו פעיל מיום פתיחת החשבון. כל שינוי בפרטי כרטיס אשראי, חייבים להיות מדווחים מיידית לספק על מנת להמשיך ולקבל שירותים באופן שוטף וללא הפסקות שירות.</li>
                            <li>חשבוניות מס יישלחו ללקוחות באמצעות דואר אלקטרוני בהתאם לחיובים שיבוצעו, מספר ימים לאחר ביצוע החיוב ובהתאם לפרטי הנמען שנמסרו על ידי הלקוח</li>
                            <li>תשלום באמצעות הפקדה/העברה בנקאית או המחאות בנקאיות, ייחשבו לתשלום בפועל, אך ורק לאחר פירעונם המלא ואישור הבנק.</li>
                            <li>ללקוחות מישראל כל התשלומים הינם במטבע ישראלי – ₪</li>
                            <li>לא יתבצע החזר כספי יחסי בגין שירותים המשולמים בתשלום ארוך טווח מראש</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">חיוב בכרטיס אשראי</h2>
                    <div className="policy-content">
                        <ul>
                            <li>הלקוח נותן למערכת זו הרשאה קבועה לחייב את חשבון הכרטיס הנ"ל, באמצעות כרטיס האשראי שאת פרטיו מסרתי לעיל, בסכומים שאחוב לכם מעת לעת בקשר לשירותים שיינתנו על-ידכם, כפי שאלו ישתקפו ברישומיכם, החיוב כאמור יבוצע על-ידכם על-ידי הודעות לחברת האשראי.</li>
                            <li>הלקוח רשאי לבטל את הרשאות, על ידי הודעה בכתב אליכם בכפוף לתנאים שלהלן:</li>
                            <li>ככל שאהיה ברשותי כרטיס ביקור דיגיטלי בחברה בעת ביטול ההרשאה, או ככל שיעמדו לחובתי עוד תשלומים</li>
                            <li>שעלי לשלם, הנני מתחייב לספק לכם אמצעי תשלום חלופי מתאים.</li>
                            <li>הביטול ייכנס לתוקף לאחר ארבעה ימי עבודה מעת קבלת ההודעה על-ידכם, ולא יחול על כל סוגי חיובי החשבון או התחייבויות שקדמו לכניסת הביטול לתוקף.</li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">שינויים בתנאי השימוש</h2>
                    <div className="policy-content">
                        <ul>
                            <li>
                                הספק רשאי לשנות את תנאי שימוש אלה מעת לעת מבלי למסור על כך הודעה מראש.
                                הספק יפרסם את התנאים החדשים ותחילת תוקפם יהיה תאריך פרסומם.
                            </li>
                        </ul>
                    </div>

                    <h2 className="policy-content-header">כללי</h2>
                    <div className="policy-content">
                        <ul>
                            <li>אי קיום של סעיף ממסמך זה ייחשב עילה להשבתה מיידית של המערכת של הלקוח וללא כל התראה מוקדמת</li>
                            <li>הספק יהיה רשאי למחוק את המערכת של אלה שעוברים על תנאי שימוש אלה כולם או מקצתם</li>
                            <li>על הסכם זה יחולו אך ורק דיני מדינת ישראלי</li>
                        </ul>
                    </div>
                </div>
            </div>
        )
    }
}

export default Policy;